{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"activation": "linear", "trainable": true, "padding": "same", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "batch_input_shape": [null, 100, 40, 1], "dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.05000000074505806}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"activation": "linear", "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.05000000074505806}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"activation": "linear", "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.05000000074505806}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "name": "dropout_3", "noise_shape": null, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 128, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.05000000074505806}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "seed": null, "name": "dropout_4", "noise_shape": null, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 2, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "trainable": true, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}